<template>
  <router-view></router-view>
</template>

<script setup>
import { provide } from "vue";
import getKitchenAndDish from "./api/getKitchenAndDish.js";

const kitchens = [];
const dishes = [];

// provide("kitchenOptions", [
//   "Абхазька",
//   "Австралійська",
//   "Азійська",
//   "Айнська",
//   "Албанська",
//   "Алжирська",
//   "Американська",
//   "Арабська",
//   "Афганська",
//   "Бангладешська",
//   "Барбадоська",
//   "Башкирська",
//   "Бірманська",
//   "Брунейська",
//   "Бурятська",
//   "Бутанська",
//   "Валлійська",
//   "Вірменська",
//   "Гавайська",
//   "Гагаузька",
//   "Галицька",
//   "Гондураська",
//   "Гренландська",
//   "Грецька",
//   "Грузинська",
//   "Домашня",
//   "Евенкійська",
//   "Еритрейська",
//   "Ескімоська",
//   "Ефіопська",
//   "Єврейська",
//   "Європейська",
//   "Єменська",
//   "Західна",
//   "Зімбабвійська",
//   "Ізраїльська",
//   "Індіанська",
//   "Індійська",
//   "Індонезійська",
//   "Іракська",
//   "Іранська",
//   "Ірландська",
//   "Ісладська",
//   "Йорданська",
//   "Кавказька",
//   "Камбоджийська",
//   "Канадська",
//   "Караїмська",
//   "Киргизька",
//   "Кіпрська",
//   "Креольська",
//   "Кримськотатарська",
//   "Лаоська",
//   "Латиноамериканська",
//   "Левантійська",
//   "Ліванська",
//   "Лівійська",
//   "Ліхтенштейнська",
//   "Мавританська",
//   "Македонська",
//   "Малазійська",
//   "Мальтійська",
//   "Мансійська",
//   "Маорійська",
//   "Марійська",
//   "Марокканська",
//   "Монгольська",
//   "Непальська",
//   "Новозеландська",
//   "Осетинська",
//   "Пакистанська",
//   "Палестинська",
//   "Південноафриканська",
//   "Північноафриканська",
//   "Пуштунська",
//   "Російська",
//   "Середземноморська",
//   "Сирійська",
//   "Сінгапурська",
//   "Словацька",
//   "Таджицька",
//   "Тайванська",
//   "Тамільска",
//   "Татарська",
//   "Тоголезька",
//   "Тувинська",
//   "Тунійська",
//   "Турецька",
//   "Угорська",
//   "Удмуртська",
//   "Уйгурська",
//   "Українська",
//   "Ф'южн",
//   "Філіппінська",
//   "Хорватська",
//   "Черкеська",
//   "Чеська",
//   "Чеченська",
//   "Чилійська",
//   "Чорногорська",
//   "Чукотська",
//   "Якутська",
//   "Японська",
// ]);

// provide("dishOptions", [
//   "Перша страва",
//   "Друга страва",
//   "Холодна страва",
//   "Гаряча страва",
//   "Десерт",
//   "Закуска",
//   "Холодний напій",
//   "Гарячий напій",
//   "Алкогольний напій",
// ]);
provide("kitchenOptions", kitchens);
provide("dishOptions", dishes);
(async () => {
  const data = await getKitchenAndDish();

  data.dishes.forEach((dish) => {
    dishes.push(dish.unnest);
  });

  data.kitchens.forEach((kitchen) => {
    kitchens.push(kitchen.unnest);
  });
})();

provide(
  "errorCodes",
  new Map([["23505", "Користувач із такою скринькою вже існує"]]),
);
</script>

<style></style>
